[
    {
        "name": "Python",
        "level": 5,
        "content": "I am proficient in Python and have used it extensively for backend development, data analysis, machine learning projects, and building RESTful APIs with FastAPI. I am familiar with libraries like NumPy, Pandas, Matplotlib, TensorFlow, and Scikit-learn."
    },
    {
        "name": "JavaScript",
        "level": 5,
        "content": "I have strong expertise in JavaScript, using it for frontend development with ReactJS and Next.js, as well as server-side scripting with Node.js. I have implemented responsive web applications, state management with Redux, and RESTful/GraphQL APIs."
    },
    {
        "name": "Java",
        "level": 5,
        "content": "I have a solid foundation in Java, having built scalable backend services using Spring Boot. I am experienced in developing microservices, designing REST APIs, and working with Hibernate for database interactions."
    },
    {
        "name": "TypeScript",
        "level": 5,
        "content": "I have experience with TypeScript, primarily for building type-safe, scalable web applications with frameworks like ReactJS and Node.js."
    },
    {
        "name": "C/C++",
        "level": 4,
        "content": "I have intermediate-level skills in C and C++, focusing on algorithms, data structures, and system programming. I am familiar with STL and multithreading techniques."
    },
    {
        "name": "HTML/CSS",
        "level": 5,
        "content": "I have extensive experience with HTML5 and CSS3, creating responsive designs and optimizing user interfaces. I am skilled in CSS-in-JS libraries, Styled Components, and preprocessors like SASS."
    },
    {
        "name": "MySQL",
        "level": 5,
        "content": "I have used MySQL for relational database management, writing complex queries, and ensuring optimized database performance in various projects."
    },
    {
        "name": "ReactJS",
        "level": 5,
        "content": "I have expertise in ReactJS, using it to develop interactive UIs, single-page applications, and progressive web applications. I have integrated state management with Redux and created reusable components for scalability."
    },
    {
        "name": "Next.js",
        "level": 5,
        "content": "I have experience with Next.js for server-side rendering and building performant, scalable web applications."
    },
    {
        "name": "Node.js",
        "level": 5,
        "content": "I have a strong background in Node.js, building server-side applications, RESTful APIs, and real-time applications."
    },
    {
        "name": "React Native",
        "level": 3,
        "content": "I have experience building cross-platform mobile applications with React Native, focusing on performance optimization and native integrations."
    },
    {
        "name": "Spring Boot",
        "level": 5,
        "content": "I have built scalable backend services and microservices using Spring Boot, implementing features like authentication, database interaction, and REST APIs."
    },
    {
        "name": "FastAPI",
        "level": 4,
        "content": "I have experience using FastAPI to build high-performance, asynchronous RESTful APIs for web applications."
    },
    {
        "name": "GraphQL",
        "level": 5,
        "content": "I have experience working with GraphQL for API development, enabling efficient querying and integration into web and mobile applications."
    },
    {
        "name": "MongoDB",
        "level": 5,
        "content": "I have extensive experience with MongoDB, using it for developing REST APIs and building prototypes. I am familiar with Mongoose for Node.js and PyMongo for Python."
    },
    {
        "name": "PostgreSQL",
        "level": 5,
        "content": "I have strong experience in managing PostgreSQL databases, writing advanced queries, and optimizing performance in complex systems."
    },
    {
        "name": "Snowflake",
        "level": 3,
        "content": "I have experience using Snowflake for data warehousing and large-scale data processing, focusing on query optimization and ETL pipelines."
    },
    {
        "name": "AWS",
        "level": 5,
        "content": "As an AWS Certified Developer Associate, I have hands-on experience deploying scalable applications, working with services like EC2, S3, DynamoDB, Lambda, and creating CI/CD pipelines."
    },
    {
        "name": "Google Cloud",
        "level": 4,
        "content": "I have experience with Google Cloud, deploying applications, managing storage solutions, and configuring Kubernetes clusters."
    },
    {
        "name": "Kubernetes",
        "level": 4,
        "content": "I have used Kubernetes to orchestrate containerized applications, manage clusters, and scale deployments efficiently."
    },
    {
        "name": "Algorithms",
        "level": 5,
        "content": "I have strong knowledge of algorithms, including sorting, searching, graph algorithms, and dynamic programming, which I’ve applied in real-world problem-solving."
    },
    {
        "name": "Object-Oriented Programming",
        "level": 5,
        "content": "I have extensive experience in object-oriented programming, designing scalable, reusable code structures across Python, Java, and TypeScript."
    },
    {
        "name": "Microservices",
        "level": 5,
        "content": "I have expertise in building microservices-based architectures using Spring Boot and FastAPI, ensuring scalability and high availability."
    },
    {
        "name": "Design Patterns",
        "level": 5,
        "content": "I am proficient in applying design patterns such as Singleton, Factory, and Observer to create clean and maintainable code."
    },
    {
        "name": "Git",
        "level": 5,
        "content": "I am proficient with Git, using it for version control, branch management, and collaborative development in team projects."
    },
    {
        "name": "Jira",
        "level": 5,
        "content": "I have used Jira extensively for project management, issue tracking, and agile sprint planning."
    },
    {
        "name": "Agile Methodologies",
        "level": 5,
        "content": "I am experienced in agile methodologies, participating in sprints, standups, and collaborative development to deliver iterative solutions."
    },
    {
        "name": "Maven",
        "level": 5,
        "content": "I have experience using Maven for dependency management and building Java projects in Spring Boot environments."
    },
    {
        "name": "MVC",
        "level": 5,
        "content": "I have implemented MVC architectures in web applications, ensuring modular and scalable codebases for both frontend and backend solutions."
    }
]
